#////////////////////////////////////////////////////
#SCRIPT DE PLACEMENT DES CELLULES
#Modified : 20 May 2022
#////////////////////////////////////////////////////

#Utilisation d'un noeud technologique supérieur ou égal à 130 nm
setDesignMode -process 250

#Placement des capa de découplage entre les rails d'alimentation vdd! gnd!
addEndCap -preCap ENDCAPL -postCap ENDCAPR -prefix ENDCAP

#Placement automatique des standard cells
setRouteMode -earlyGlobalMaxRouteLayer 4
setRouteMode -earlyGlobalMinRouteLayer 1


place_opt_design
#setPlaceMode -fp false
#placeDesign -noPrePlaceOpt



setOptMode -fixCap true -fixTran  true -fixFanoutLoad false
optDesign -preCTS

source ../SCRIPTS/clock_tree_synthesis.tcl

optDesign -postCTS

#routeDesign -globalDetail

#setAnalysisMode -analysisType onChipVariation -cppr both
#setOptMode -fixCap true -fixTran true -fixFanoutLoad false




setNanoRouteMode -routeTopRoutingLayer 4
setNanoRouteMode -routeBottomRoutingLayer 1
setSignoffOptMode -fixGlitch true
setNanoRouteMode -routeWithSiDriven true


setNanoRouteMode -drouteFixAntenna true

routeDesign

setExtractRCMode -engine postRoute
setExtractRCMode -effortLevel signoff


optDesign -postRoute
pinAnalysis
route_opt_design






