###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID cimeld40.cime.inpg.fr)
#  Generated on:      Thu Jun  9 16:49:15 2022
#  Design:            top_io
#  Command:           saveDesign dbs/top_essay_io
###############################################################
current_design top_io
create_clock [get_pins {io_inClock/Y}]  -name inClock -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_pins {io_inClock/Y}]
